---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MechanicalEquipmentSetIdParam
source: html/86a2ffcb-080a-5b95-57ad-c4caa69fafc9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MechanicalEquipmentSetIdParam Property

"Mechanical Equipment Set"

## Syntax (C#)
```csharp
public static ForgeTypeId MechanicalEquipmentSetIdParam { get; }
```